## Plan Result (stg_gaps2 - TerraformPlanApply)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.storage_primary_key
  * module.storage_account.azurerm_private_endpoint.dfs_endpoint[0]
* Update
  * module.storage_account.azurerm_storage_account.storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.storage_primary_key will be created
  + resource "azurerm_key_vault_secret" "storage_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/gaps2-stg-rg/providers/Microsoft.KeyVault/vaults/gaps2-kv-stg"
      + name                    = "hmctsgaps2stgsftp-primary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.storage_account.azurerm_private_endpoint.dfs_endpoint[0] will be created
  + resource "azurerm_private_endpoint" "dfs_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "hmctsgaps2stgsftp-dfs"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "jumpbox-nonprod-rg"
      + subnet_id                = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/jumpbox-nonprod-rg/providers/Microsoft.Network/virtualNetworks/jumpbox-nonprod-vnet/subnets/gaps2-subnet"
      + tags                     = {
          + "application"  = "gaps2"
          + "builtFrom"    = "hmcts/gaps2-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dfs-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "hmctsgaps2stgsftp-dfs"
          + private_connection_resource_id = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/gaps2-stg-rg/providers/Microsoft.Storage/storageAccounts/hmctsgaps2stgsftp"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/gaps2-stg-rg/providers/Microsoft.Storage/storageAccounts/hmctsgaps2stgsftp"
        name                               = "hmctsgaps2stgsftp"
        tags                               = {
            "application"  = "gaps2"
            "builtFrom"    = "hmcts/gaps2-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "90.194.180.236",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":10,"Program":"tfcmt","SHA1":"","Target":"stg_gaps2 - TerraformPlanApply","Vars":{}} -->